danyial/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
/****************************************************************************
* Title                 :   drive motor module
* Filename              :   drivemotor.c
* Author                :   Nekraus
* Origin Date           :   18/08/2022
* Version               :   1.0.0

*****************************************************************************/
/** \file drivemotor.c
 *  \brief drive motor module
 *
 */
/******************************************************************************
 * Includes
 *******************************************************************************/
#include <string.h>
#include <stdlib.h>

#include "stm32f_board_hal.h"

#include "main.h"
#include "ros/ros_custom/cpp_main.h"
#include "board.h"
#include "adc.h"

#include "drivemotor.h"

/******************************************************************************
 * Module Preprocessor Constants
 *******************************************************************************/
#define DRIVEMOTOR_LENGTH_INIT_MSG 38
#define DRIVEMOTOR_LENGTH_RQST_MSG 12
#define DRIVEMOTOR_LENGTH_RECEIVED_MSG 20
/******************************************************************************
 * Module Preprocessor Macros
 *******************************************************************************/

/******************************************************************************
 * Module Typedefs
 *******************************************************************************/
typedef enum
{
    DRIVEMOTOR_INIT_1,
    DRIVEMOTOR_INIT_2,
    DRIVEMOTOR_RUN,
    DRIVEMOTOR_BACKWARD,
    DRIVEMOTOR_WAIT
} DRIVEMOTOR_STATE_e;

typedef struct
{
    /* 0*/ uint16_t u16_preambule;
    /* 2*/ uint8_t u8_length;
    /* 3*/ uint16_t u16_id;
    /* 5*/ uint8_t u8_direction;
    /* 6*/ uint8_t u8_left_speed;
    /* 7*/ uint8_t u8_right_speed;
    /* 8*/ uint16_t u16_ukndata0;
    /*10*/ uint8_t u8_left_power;
    /*11*/ uint8_t u8_right_power;
    /*12*/ uint8_t u8_error;
    /*13*/ uint16_t u16_left_ticks;
    /*15*/ uint16_t u16_right_ticks;
    /*17*/ uint8_t u8_left_ukn;
    /*18*/ uint8_t u8_right_ukn;
    /*19*/ uint8_t u8_CRC;
} __attribute__((__packed__)) DRIVEMOTORS_data_t;

/******************************************************************************
 * Module Variable Definitions
 *******************************************************************************/
UART_HandleTypeDef DRIVEMOTORS_USART_Handler; // UART  Handle

DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;

static DRIVEMOTOR_STATE_e drivemotor_eState = DRIVEMOTOR_INIT_1;
static rx_status_e drivemotors_eRxFlag = RX_WAIT;

static DRIVEMOTORS_data_t drivemotor_psReceivedData = {0};
static uint8_t drivemotor_pu8RqstMessage[DRIVEMOTOR_LENGTH_RQST_MSG] = {0x55, 0xaa, 0x08, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

const uint8_t drivemotor_pcu8Preamble[5] = {0x55, 0xAA, 0x10, 0x01, 0xE0};
// const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = { 0x55, 0xaa, 0x08, 0x10, 0x80, 0xa0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x37};
const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = {0x55, 0xaa, 0x22, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x02, 0xC8, 0x46, 0x0C, 0x00, 0x00, 0x00, 0x00, 0x05, 0x0F, 0x14, 0x96, 0x0A, 0x1E, 0x5a, 0xfa, 0x05, 0x0A, 0x14, 0x32, 0x40, 0x04, 0x20, 0x01, 0x00, 0x00, 0x2C, 0x01, 0xEE};

int8_t prev_left_direction = 0;
int8_t prev_right_direction = 0;
uint16_t prev_right_encoder_val = 0;
uint16_t prev_left_encoder_val = 0;
int16_t prev_right_wheel_speed_val = 0;
int16_t prev_left_wheel_speed_val = 0;
uint32_t right_encoder_ticks = 0;
uint32_t left_encoder_ticks = 0;
int32_t  right_ticks_signed = 0;  /**< Cumulative SIGNED encoder ticks (polarity = direction) */
int32_t  left_ticks_signed  = 0;
int8_t left_direction = 0;
int8_t right_direction = 0;
uint16_t right_encoder_val = 0;
uint16_t left_encoder_val = 0;
int16_t right_wheel_speed_val = 0;
int16_t left_wheel_speed_val = 0;
uint8_t right_power = 0;
uint8_t left_power = 0;

uint32_t DRIVEMOTOR_u32ErrorCnt = 0;

static uint8_t left_speed_req;
static uint8_t right_speed_req;
static uint8_t left_dir_req;
static uint8_t right_dir_req;

/* PWM stiction-overcome offset.
 *
 * History:
 *   - 2026-04-19: removed a host-side ±35 PWM snap-up that caused 2.5×
 *     angular overshoot at low wz (Voie C Test: commanded 90° → measured
 *     225°). The snap promoted any |x| in [1,34] to exactly ±35 — fine for
 *     pure forward motion but a disaster for small differential commands.
 *   - 2026-04-25: nav2_velocity_smoother deadband lowered 0.13 → 0.04 m/s
 *     (PR #17) so undock could push small reverse commands through. This
 *     left a window where commands of 0.04–0.10 m/s reach the firmware as
 *     12–30 PWM units — under typical static-friction threshold for the
 *     drive motors, so the wheels twitch but do not actually rotate.
 *
 * Today's compromise: a SMOOTH additive offset that decays linearly with
 * commanded magnitude. Any non-zero command is bumped up just enough to
 * overcome stiction; above STICTION_TAPER_END_PWM the bump is zero and
 * the command passes through unchanged.
 *
 *   effective = magnitude + STICTION_PWM * max(0, TAPER_END - magnitude) / TAPER_END
 *
 * Tuning targets:
 *   - STICTION_PWM: just enough to overcome static friction on a level
 *     surface (motor-dependent, empirical). Too low → wheels still
 *     twitch. Too high → angular overshoot creeps back in. Bench-test
 *     by sending small wz commands and measuring physical rotation.
 *   - STICTION_TAPER_END_PWM: where the help should disappear entirely.
 *     Too low → small commands still under-power. Too high → distortion
 *     of the lower dynamic range, which re-introduces overshoot at low wz.
 *
 * Values below are conservative defaults; tune per bench observation. */
#define STICTION_PWM             20
#define STICTION_TAPER_END_PWM   30

static int16_t apply_stiction_offset(int16_t pwm_signed)
{
    if (pwm_signed == 0) {
        return 0;
    }
    int16_t magnitude = (pwm_signed < 0) ? -pwm_signed : pwm_signed;
    int16_t offset = 0;
    if (magnitude < STICTION_TAPER_END_PWM) {
        offset = (int16_t)(((int32_t)STICTION_PWM *
                            (STICTION_TAPER_END_PWM - magnitude)) /
                           STICTION_TAPER_END_PWM);
    }
    int16_t result = magnitude + offset;
    if (result > 255) {
        result = 255;
    }
    return (pwm_signed > 0) ? result : -result;
}

