danyial/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
        /* todo add also accelerometer detection*/
        if ((HALLSTOP_Left_Sense() || HALLSTOP_Right_Sense()) && (left_dir_req || right_dir_req))
        {

            switch (main_eOpenmowerStatus)
            {
            case OPENMOWER_STATUS_MOWING:
                /*hit something goes back */
                drivemotor_eState = DRIVEMOTOR_BACKWARD;
                l_u32Timestamp = HAL_GetTick();
                break;
            case OPENMOWER_STATUS_DOCKING:
                /* Get voltage from dock, stop the mower*/
                if (chargerInputVoltage > MIN_DOCKED_VOLTAGE)
                {
                    drivemotor_prepareMsg(0, 0, 0, 0);
                }
                else
                { /*hit something goes back */
                    drivemotor_eState = DRIVEMOTOR_BACKWARD;
                    l_u32Timestamp = HAL_GetTick();
                }

                break;
            case OPENMOWER_STATUS_UNDOCKING:
            case OPENMOWER_STATUS_IDLE:
            case OPENMOWER_STATUS_RECORD:
            default:
                /* nothing to do in these modes*/
                break;
            }
        }

        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

        break;

    case DRIVEMOTOR_BACKWARD:
        /* prepare to receive the message before to launch the command */
        HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)&drivemotor_psReceivedData, sizeof(DRIVEMOTORS_data_t));
        drivemotor_prepareMsg(100, 100, 0, 0); /* set to -0.33m/s  */
        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

        if ((HAL_GetTick() - l_u32Timestamp) > 2000)
        {
            drivemotor_eState = DRIVEMOTOR_WAIT;
            l_u32Timestamp = HAL_GetTick();
        }

        break;

    case DRIVEMOTOR_WAIT:
        /* prepare to receive the message before to launch the command */
        HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)&drivemotor_psReceivedData, sizeof(DRIVEMOTORS_data_t));
        drivemotor_prepareMsg(0, 0, 0, 0);
        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

        if ((HAL_GetTick() - l_u32Timestamp) > 1000)
        {
            drivemotor_eState = DRIVEMOTOR_RUN;
        }

        break;

    default:
        break;
    }

    /* TODO error management */
    switch (drivemotors_eRxFlag)
    {
    case RX_VALID:
        break;

    case RX_WAIT:

        /* todo check for timeout */

        break;

    case RX_CRC_ERROR:
    case RX_INVALID_ERROR:
    case RX_TIMEOUT_ERROR:
    default:
        /* inform for error */
        break;
    }
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void)
{
    if (drivemotors_eRxFlag == RX_VALID)
    {
        /* decode */
        uint8_t direction = drivemotor_psReceivedData.u8_direction;
        // we need to adjust for direction (+/-) !
        if ((direction & 0xc0) == 0xc0)
        {
            left_direction = 1;
        }
        else if ((direction & 0x80) == 0x80)
        {
            left_direction = -1;
        }
        else
        {
            left_direction = 0;
        }
        if ((direction & 0x30) == 0x30)
        {
            right_direction = 1;
        }
        else if ((direction & 0x20) == 0x20)
        {
            right_direction = -1;
        }
        else
        {
            right_direction = 0;
        }

        left_encoder_val = drivemotor_psReceivedData.u16_left_ticks;
        right_encoder_val = drivemotor_psReceivedData.u16_right_ticks;

        // power consumption
        left_power = drivemotor_psReceivedData.u8_left_power;
        right_power = drivemotor_psReceivedData.u8_right_power;

        /*
         * Motor-controller encoder quirk: the 16-bit encoder register can
         * reset to 0 when the wheel's commanded direction changes (and again
         * when the speed crosses from 0 to non-zero). Detect those events
         * and restart the delta window so we don't register a massive phantom
         * jump.
         */
        /*
         * Direction-change fence: when `left_encoder_reset` is true the
         * motor-controller PCB is in the middle of a direction/speed
         * transient and its encoder register may or may not have been
         * zeroed by the controller yet. Rather than GUESS (which the old
         * `prev_left_encoder_val = 0` did, and failed catastrophically
         * when the controller had NOT reset yet: delta_raw =
         * current_encoder_val - 0 = tens of thousands of ticks
         * mistakenly attributed to the new direction, producing
         * ±1000 m/s bogus velocities downstream), we SYNC `prev` to
         * whatever the current encoder value is. Delta for this one
         * packet is then 0 — we concede up to ~21 ms of fine-grained
         * odometry tracking during the transient, which at 0.5 m/s max
         * is 10 mm — in exchange for never emitting a bogus tick-burst
         * on direction change.
         *
         * Subsequent packets compute deltas against the post-transient
         * baseline, so the rest of the trajectory is uncorrupted.
         */
        left_wheel_speed_val = left_direction * drivemotor_psReceivedData.u8_left_speed;
        const uint8_t left_encoder_reset =
            (left_direction == 0) ||
            (left_direction != prev_left_direction) ||
            (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0);
        if (left_encoder_reset)
        {
            prev_left_encoder_val = left_encoder_val;  /* sync, not zero */
        }

        /* Encoder register wraps around 0xFFFF; the delta is computed as an
         * unsigned subtraction (natural wrap handling) provided the wheel
         * hasn't spun >32768 ticks in one 20 ms sample (~100 m/s — impossible
         * for a mower).
         */
        const uint16_t left_delta_raw = left_encoder_val - prev_left_encoder_val;
        /* Legacy cumulative counter (unsigned-abs) kept for any existing
         * consumer that still expects monotonic positive ticks. New code
         * should use left_ticks_signed. */
        left_encoder_ticks += (uint32_t)left_delta_raw;
        /* Signed cumulative count — polarity lives in the sign, no need for
         * a separate direction byte downstream. */
        left_ticks_signed += (int32_t)left_delta_raw * (int32_t)left_direction;
        prev_left_encoder_val = left_encoder_val;
        prev_left_wheel_speed_val = left_wheel_speed_val;
        prev_left_direction = left_direction;

