danyial/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
        /* Same fence for the right wheel — direction-change transient is
         * per-wheel on a differential-drive platform (e.g. an in-place
         * pivot has left and right transitions at different times). */
        right_wheel_speed_val = right_direction * drivemotor_psReceivedData.u8_right_speed;
        const uint8_t right_encoder_reset =
            (right_direction == 0) ||
            (right_direction != prev_right_direction) ||
            (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0);
        if (right_encoder_reset)
        {
            prev_right_encoder_val = right_encoder_val;  /* sync, not zero */
        }
        const uint16_t right_delta_raw = right_encoder_val - prev_right_encoder_val;
        right_encoder_ticks += (uint32_t)right_delta_raw;
        right_ticks_signed += (int32_t)right_delta_raw * (int32_t)right_direction;
        prev_right_encoder_val = right_encoder_val;
        prev_right_wheel_speed_val = right_wheel_speed_val;
        prev_right_direction = right_direction;

        wheelTicks_handler(left_ticks_signed, right_ticks_signed,
                           left_wheel_speed_val, right_wheel_speed_val);

        drivemotors_eRxFlag = RX_WAIT; // ready for next message
    }
}

/**
 * @brief  Set drive motor speeds from a signed PWM command per wheel.
 *
 * Single scalar per wheel encodes both magnitude and direction: positive =
 * forward, negative = reverse, 0 = stop. The motor-controller PCB's legacy
 * (|speed|, direction-bit) interface is produced internally by this function.
 *
 * Applies a smooth stiction-overcome offset (see apply_stiction_offset
 * comment block above) so small commands actually break static friction
 * instead of just buzzing the motor. Saturates to 8-bit motor-controller
 * magnitude range.
 *
 * @param  left_pwm_signed   signed PWM command for the left wheel
 * @param  right_pwm_signed  signed PWM command for the right wheel
 */
void DRIVEMOTOR_SetSpeedSigned(int16_t left_pwm_signed, int16_t right_pwm_signed)
{
    /* Friction-overcome offset BEFORE saturation so the offset can push
     * a borderline command up into the moving range without exceeding 255. */
    left_pwm_signed  = apply_stiction_offset(left_pwm_signed);
    right_pwm_signed = apply_stiction_offset(right_pwm_signed);

    /* Saturate to the 8-bit motor-controller magnitude. */
    if (left_pwm_signed  >  255) left_pwm_signed  =  255;
    if (left_pwm_signed  < -255) left_pwm_signed  = -255;
    if (right_pwm_signed >  255) right_pwm_signed =  255;
    if (right_pwm_signed < -255) right_pwm_signed = -255;

    left_speed_req  = (uint8_t)(left_pwm_signed  < 0 ? -left_pwm_signed  : left_pwm_signed);
    right_speed_req = (uint8_t)(right_pwm_signed < 0 ? -right_pwm_signed : right_pwm_signed);

    /* Motor-controller convention: dir=1 → forward at |speed|, dir=0 →
     * reverse at |speed| (or stop when |speed|=0). Only forward maps to
     * a non-zero dir byte. */
    left_dir_req  = (left_pwm_signed  > 0) ? 1 : 0;
    right_dir_req = (right_pwm_signed > 0) ? 1 : 0;
}

/**
 * @brief  Legacy 4-argument form kept as a thin shim over the signed API so
 *         any caller that still uses `(speed, speed, dir, dir)` keeps
 *         working. New code should call DRIVEMOTOR_SetSpeedSigned directly.
 */
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    const int16_t l_signed = left_dir  ? (int16_t)left_speed  : -(int16_t)left_speed;
    const int16_t r_signed = right_dir ? (int16_t)right_speed : -(int16_t)right_speed;
    /* If both speeds are 0, the deadband path passes 0 through unchanged,
     * matching the old "0,0,0,0 == stop" contract. */
    DRIVEMOTOR_SetSpeedSigned(
        (left_speed  == 0) ? 0 : l_signed,
        (right_speed == 0) ? 0 : r_signed);
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void)
{
    /* decode the frame */
    if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_psReceivedData, 5) == 0)
    {
        uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_psReceivedData, DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
        if (drivemotor_psReceivedData.u8_CRC == l_u8crc)
        {
            drivemotors_eRxFlag = RX_VALID;
        }
        else
        {
            drivemotors_eRxFlag = RX_CRC_ERROR;
        }
    }
    else
    {
        drivemotors_eRxFlag = RX_INVALID_ERROR;
    }
}

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{

    uint8_t direction = 0x0;

    // calc direction bits
    if (right_dir == 1)
    {
        direction |= (0x20 + 0x10);
    }
    else
    {
        direction |= 0x20;
    }
    if (left_dir == 1)
    {
        direction |= (0x40 + 0x80);
    }
    else
    {
        direction |= 0x80;
    }

    drivemotor_pu8RqstMessage[0] = 0x55;
    drivemotor_pu8RqstMessage[1] = 0xaa;
    drivemotor_pu8RqstMessage[2] = 0x08;
    drivemotor_pu8RqstMessage[3] = 0x10;
    drivemotor_pu8RqstMessage[4] = 0x80;
    drivemotor_pu8RqstMessage[5] = direction;
    drivemotor_pu8RqstMessage[6] = left_speed;
    drivemotor_pu8RqstMessage[7] = right_speed;
    drivemotor_pu8RqstMessage[9] = 0;
    drivemotor_pu8RqstMessage[8] = 0;
    drivemotor_pu8RqstMessage[10] = 0;
    drivemotor_pu8RqstMessage[11] = crcCalc(drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG - 1);
}
